{"reminiscences-of-pioneer-days-in-st-paul": "In the mid-19th century, St. Paul, Minnesota, a rapidly growing city plagued by fires, formed a volunteer fire brigade in 1851. The city attracted prominent figures like General William H. Seward and James M. Goodhue, a leader in the local printing industry. As the city grew and prepared for the Civil War, it sent one regiment to battle and then volunteered for a second. The city's newspaper, the Minnesotian, was a significant part of the local media landscape.\n\nFrank Moore, a 15-year-old boy from Tioga county, Pennsylvania, moved to St. Paul with his brother, George W. Moore, who was one of the owners and managers of the Minnesotian. Frank began working as a printer's \"devil\" at the Minnesotian, where his duties included carrying water from a spring below the Merchants hotel and meeting boats to collect newspapers. The Minnesotian played a crucial role in disseminating news to the city, including telegraph news from around the world.\n\nA voyageur from Minnesota traveled to the Gulf of Mexico, where he met a dusky maiden and received an astrological prophecy about Robert, who would become a mighty chief of a great city to be built on the site of St. Paul. According to the prophecy, Robert would have to navigate complex politics and diplomacy while avoiding division among his constituents. The prophecy also mentioned the Okons, a noble family from Ireland, who would support Robert.\n\nThe battle of Shiloh, also known as Pittsburg Landing, marked a turning point in the war, with the Union army emerging victorious under General Ulysses S. Grant's leadership. The First Minnesota Battery, a light artillery unit, played a crucial role in the battle, repelling the Confederate forces despite suffering casualties. Captain William Henry Acker, a native New Yorker who moved to St. Paul in 1854, was killed in action at Shiloh, shot in the forehead by a rebel bullet. A grand army post was later named in his honor.\n\nIn St. Paul, the city mourned the loss of Captain Acker and remembered the heroism he displayed on and off the battlefield. A city resident, an aged voyageur, felt a deep sense of anguish at the omnipresence of the Okons, who were now firmly entrenched in the city's politics. The voyageur quietly retreated from the city, never to be seen again by the subjects of the paleface, Robert A. Smith, who was running for mayor.\n\nIn a small village in northern Pennsylvania, a young boy, around 12 years old, lived in a sparsely settled area before the advent of the railroad and telegraph. The boy's community was not blessed with prosperity, and intellectual attainments were scarce. However, the boy was eager to learn and acquire knowledge. The school district in his area was fortunate to support a school for six months a year, and the older children were not permitted to attend during the summer months, as their services were considered indispensable in the cultivation of the soil.\n\nThe boy's school had a weekly spelling match and recitation on Saturday nights, and every four weeks, they would meet with schools in other districts for a grand spelling contest. The boy was considered too young to participate in the joint spelling matches, but he was determined to demonstrate his spelling skills. One Saturday night, the boy managed to sneak onto a sleigh bound for a grand spelling match at a country crossroad, where four schools were participating. The boy's quick thinking and cleverness earned him a spot in the spelling match, where he correctly spelled the word \"phthisic,\" impressing the school-master and the other scholars."}