{"reminiscences-of-pioneer-days-in-st-paul": "The city of St. Paul, Minnesota, in the mid-19th century was a hub of activity, witnessing an array of remarkable events that played a crucial role in shaping the region's history. James M. Goodhue's arrival in St. Paul in 1849 marked the beginning of this era, as he established The Pioneer, the first newspaper in the city, accompanied by two young printers, Ditmarth and Dempsey. However, they soon returned home, leading Goodhue to seek the services of Captain E.Y. Shelly, a veteran of the Mexican War, who became the first printer to permanently settle in Minnesota.\n\nAs the city unfolded, it faced numerous challenges, including wildfires, which destroyed hotels such as the Central house, Park Place hotel, and Carpenter house. Despite these setbacks, the city continued to grow, with the introduction of the first telegraph lines, allowing newspapers to receive news from Washington in a matter of days. This innovation significantly impacted the competitive world of 19th-century journalism, with newspapers such as The Pioneer and Minnesotian vying for the attention of the local population.\n\nA significant event that drew the attention of St. Paul residents in 1858 was the completion of the Atlantic cable, marking the first time a transatlantic communication had occurred. The news of this achievement sparked a grand celebration in the city, featuring a colorful parade with various groups and floats showcasing the city's military, fire department, and secret societies. This event, known as the \"Laying of the Atlantic Cable Celebration,\" helped solidify St. Paul's reputation as a beacon of innovation and progress.\n\nIn 1860, a large excursion party of members of the Sons of Malta visited the city, which included notable figures such as the celebrated elocutionist, Alf. Burnett. This secret order, organized in the Eastern states in the early 1850s, had made a significant impact in the region's social scene. However, some stories surrounding the Sons of Malta suggested that their initiation process was quite peculiar and often bordering on the sinister.\n\nAs the decade progressed, the United States nation found itself embroiled in the American Civil War. In 1861, Minnesota was required to furnish five regiments for the war effort, sparking a chain of events that would lead to the Dakota War of 1862. President Jefferson informed General Gold, the U.S. commander at Sioux Falls, that several hundred volunteers were needed to be sent to northeastern Nebraska to defuse the war crisis between Native Americans. The situation escalated rapidly, leading to the outbreak of violence in Minnesota, resulting in the deaths of over 1,000 people and millions of dollars in property damage.\n\nGeneral Sibley ultimately led a force of approximately 2,000 men to confront the Sioux and her forces in the growing escalating conflict. On September 23, 1862, they encountered a group of Sioux warriors near Wood Lake, leading to a spirited engagement, with the Sioux being ultimately routed. However, the aftermath of the war brought numerous controversies, particularly surrounding the deaths of thirty-eight Indians, with many Native Americans viewing the event as an execution.\n\nThe union rose victorious in the end. Captain Shelly mustered out of the service in the spring of 1865 and went back to being a printer after having a considerable presence in battles and victories throughout the American Civil War period. His first military role started at the early stages of the war in 1861; he obtained honors after fighting eruptively at the pivotal point in the Mill Springs campaign where they directly fought Confederate forces and captured a significant amount of their firearms."}