{"reminiscences-of-pioneer-days-in-st-paul": "The story is set in the mid-19th century in St. Paul, Minnesota, a rapidly growing city with a dynamic newspaper industry. The city's early newspapers, such as the Pioneer and the Minnesotian, were small operations with limited resources, employing a single pressman, a few compositors, two editors, and a business manager. The industry's growth was hindered by the lack of modern technology, with a single hand press capable of producing only 240 impressions per hour. The Minnesotian, in particular, was a notable newspaper that played a significant role in the city's journalism scene.\n\nIn 1857, a constitutional convention was held in Minnesota, and the Minnesotian was awarded the contract to print the proceedings of the Democratic convention. However, the Pioneer, led by state printer Mr. Goodrich, claimed the right to print the proceedings of both conventions, leading to a court case that ultimately favored the Minnesotian. The Minnesotian's business manager, Mr. Moore, was able to distribute $4,000 to his employees after the court's decision. This event marked a significant milestone for the Minnesotian, establishing its reputation as a prominent newspaper in the city.\n\nThe city's residents eagerly awaited news of the successful laying of the Atlantic cable in 1858, with two steamboats, the Gray Eagle and the Itasca, racing to bring the news to St. Paul. The Minnesotian's messenger was able to obtain a copy of the Dubuque Herald containing the Queen's message, allowing the newspaper to publish an extra edition before its competitors. The Minnesotian was also a pioneer in local feature illustration, with a notable example being the lynching of a man in Wright county in 1859. This attention to local events and the use of illustrations set the Minnesotian apart from its competitors.\n\nThe same year saw a heated gubernatorial election between Alexander Ramsey and George L. Becker, with the Republicans making significant efforts to elect their state and legislative tickets. The election was marked by the presence of prominent speakers, including the Hon. Galusha A. Grow and the Hon. Schuyler Colfax, whose speeches were interrupted by a fire that destroyed the old People's theater where they were scheduled to speak. Despite the chaos, the Minnesotian was able to publish an account of the event, highlighting the newspaper's dedication to providing timely and accurate information to its readers.\n\nThe Minnesotian's editor, Dr. Foster, was a prominent figure in the Republican party and was known for his irascible temper and his ability to write scathing editorials. He was particularly vocal about the execution of John Brown and President Buchanan's veto of the Homestead Law. The Minnesotian's proprietor attempted to gain an advantage by intercepting the mail coach, but the effort ultimately failed.\n\nThe newspapers also struggled with the high cost of telegraph news, which made it difficult for them to keep up with the latest news. The Minnesotian and Times eventually formed an agreement to boycott the telegraph company's extortionate rates, but the Pioneer secretly made a deal with the company, leaving the other two papers at a disadvantage. The economic struggles of the time were reflected in the low wages and scarcity of money, with married men being fortunate to receive an order for $4 or $5 on Saturday night, and single men receiving even less.\n\nThe introduction of the Press in 1861 brought about a change in the custom of paying employees every Saturday night. A notable visit by Republican statesmen, including William Seward, predicted that the capitol of the United States would be located near the Falls of St. Anthony. However, the news of his speech was only available to those who could access the New York Herald. The completion of the telegraph line in 1860 brought about a new era of news dissemination, but the high costs made it difficult for the papers to afford the \"latest news by Associated Press.\" The Pioneer's editor, Earle S. Goodrich, played a prank on the Minnesotian by creating bogus telegraph dispatches, which the Minnesotian fell for, only to be later exposed by the Times."}